{"backend": "tensorflow", "config": {"name": "sequential_2", "layers": [{"config": {"name": "reshape_1", "target_shape": [50, 50, 1], "batch_input_shape": [null, 2500], "trainable": true, "dtype": "float32"}, "class_name": "Reshape"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "dilation_rate": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": {"config": {"max_value": 3, "axis": 0}, "class_name": "MaxNorm"}, "activity_regularizer": null, "trainable": true, "dtype": "float32", "filters": 32, "data_format": "channels_last", "kernel_regularizer": null, "batch_input_shape": [null, 50, 50, 1], "kernel_size": [5, 5], "strides": [1, 1], "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "dilation_rate": [1, 1], "use_bias": true, "padding": "valid", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "filters": 32, "data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [2, 2], "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "name": "dropout_1", "noise_shape": null, "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_3", "dilation_rate": [1, 1], "use_bias": true, "padding": "valid", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "filters": 32, "data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [5, 5], "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "name": "dropout_2", "noise_shape": null, "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_1", "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "units": 1024, "kernel_constraint": {"config": {"max_value": 3, "axis": 0}, "class_name": "MaxNorm"}, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_2", "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "units": 512, "kernel_constraint": {"config": {"max_value": 3, "axis": 0}, "class_name": "MaxNorm"}, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_3", "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "units": 256, "kernel_constraint": {"config": {"max_value": 3, "axis": 0}, "class_name": "MaxNorm"}, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_4", "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "units": 128, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"seed": null, "name": "dropout_3", "noise_shape": null, "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_5", "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "units": 63, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "softmax"}, "class_name": "Dense"}]}, "class_name": "Sequential", "keras_version": "2.2.4"}